In [2]:
import pandas as pd

## Read training CSV (Not as easy as you think)

In [25]:
# Read the csv file into a pandas DataFrame
df = pd.read_csv('resources/train.csv')
df

                  id        date  store_nbr  item_nbr  unit_sales onpromotion
0                  0  2013-01-01         25    103665         7.0         NaN
1                  1  2013-01-01         25    105574         1.0         NaN
2                  2  2013-01-01         25    105575         2.0         NaN
3                  3  2013-01-01         25    108079         1.0         NaN
4                  4  2013-01-01         25    108701         1.0         NaN
...              ...         ...        ...       ...         ...         ...
125497035  125497035  2017-08-15         54   2089339         4.0       False
125497036  125497036  2017-08-15         54   2106464         1.0        True
125497037  125497037  2017-08-15         54   2110456       192.0       False
125497038  125497038  2017-08-15         54   2113914       198.0        True
125497039  125497039  2017-08-15         54   2116416         2.0       False

[125497040 rows x 6 columns]

In [4]:
df = df.dropna(how='any')

In [5]:
df.dtypes

id               int64
date            object
store_nbr        int64
item_nbr         int64
unit_sales     float64
onpromotion     object
dtype: object

In [6]:
# convert the 'Date' column to datetime format 
from datetime import date
df['date']= pd.to_datetime(df['date'])

df.dtypes

id                      int64
date           datetime64[ns]
store_nbr               int64
item_nbr                int64
unit_sales            float64
onpromotion            object
dtype: object

## Filter for 2015 Data (Dataframe still too big to casually export as CSV)

In [7]:
# # import datetime
# start_date = '2015-01-01'
# end_date = '2015-12-31'

# mask = (df['date'] > start_date) & (df['date'] <= end_date)

# data_2015 = df.loc[mask]

# CHRISTMAS ANALYSIS
## 2014 - Christmas Eve

In [13]:
import datetime

start_date = '2014-12-24'

mask = (df['date'] == start_date)

navidad_2014 = df.loc[mask]
navidad_2014.head(3)

                id       date  store_nbr  item_nbr  unit_sales onpromotion
38069001  38069001 2014-12-24          1    103520         3.0       False
38069002  38069002 2014-12-24          1    103665         6.0       False
38069003  38069003 2014-12-24          1    105574         1.0       False

In [14]:
# save as CSV
navidad_2014.to_csv('export/navidad_2014_12_24.csv', index=False)

## 2014 - Day after Christmas

In [11]:
import datetime

start_date = '2014-12-26'

mask = (df['date'] == start_date)

navidad_2014_12_26 = df.loc[mask]
navidad_2014_12_26.head(3)

                id       date  store_nbr  item_nbr  unit_sales onpromotion
38144506  38144506 2014-12-26          1    105575        19.0       False
38144507  38144507 2014-12-26          1    105577         1.0       False
38144508  38144508 2014-12-26          1    106716         2.0       False

In [12]:
# save as CSV
navidad_2014_12_26.to_csv('export/navidad_2014_12_26.csv', index=False)

## 2015 - Christmas Eve

In [17]:
import datetime

start_date = '2015-12-24'

mask = (df['date'] == start_date)

navidad_2015 = df.loc[mask]
navidad_2015.head(3)

                id       date  store_nbr  item_nbr  unit_sales onpromotion
65783029  65783029 2015-12-24          1    103520         4.0       False
65783030  65783030 2015-12-24          1    103665         6.0       False
65783031  65783031 2015-12-24          1    105574         3.0       False

In [18]:
# save as CSV
navidad_2015.to_csv('export/navidad_2015_12_24.csv', index=False)

## 2015 - Day after Christmas

In [19]:
import datetime

start_date = '2015-12-26'

mask = (df['date'] == start_date)

navidad_2015_12_26 = df.loc[mask]
navidad_2015.head(3)

                id       date  store_nbr  item_nbr  unit_sales onpromotion
65783029  65783029 2015-12-24          1    103520         4.0       False
65783030  65783030 2015-12-24          1    103665         6.0       False
65783031  65783031 2015-12-24          1    105574         3.0       False

In [20]:
# save as CSV
navidad_2015_12_26.to_csv('export/navidad_2015_12_26.csv', index=False)

## 2016 - Christmas Eve

In [21]:
import datetime

start_date = '2016-12-24'

mask = (df['date'] == start_date)

navidad_2016 = df.loc[mask]
navidad_2016.head(3)

                  id       date  store_nbr  item_nbr  unit_sales onpromotion
100931124  100931124 2016-12-24          1     99197         2.0       False
100931125  100931125 2016-12-24          1    103520         4.0       False
100931126  100931126 2016-12-24          1    103665         6.0       False

In [22]:
# save as CSV
navidad_2016.to_csv('export/navidad_2016_12_24.csv', index=False)

## 2016 - Day after Christmas

In [23]:
import datetime

start_date = '2016-12-26'

mask = (df['date'] == start_date)

navidad_2016_12_26 = df.loc[mask]
navidad_2016.head(3)

                  id       date  store_nbr  item_nbr  unit_sales onpromotion
100931124  100931124 2016-12-24          1     99197         2.0       False
100931125  100931125 2016-12-24          1    103520         4.0       False
100931126  100931126 2016-12-24          1    103665         6.0       False

In [24]:
# save as CSV
navidad_2016_12_26.to_csv('export/navidad_2016_12_26.csv', index=False)